Running into this as well. I can try to provide a sample configuration after some cleanup. But basically, I have an EFS, S3 bucket, and a Datasync task copying from S3 to EFS. The `aws_datasync_location_s3` and `aws_datasync_task` resources always get replaced for some reason, even if I just applied the changes, and I've touched nothing else since, neither on the AWS console, nor with the infra code.

This is the output I get, with just some IDs redacted:

```
Terraform will perform the following actions:

  # aws_datasync_location_efs.dags must be replaced
-/+ resource "aws_datasync_location_efs" "dags" {
      ~ arn                 = "arn:aws:datasync:eu-central-1:account1id:location/loc-loc1id" -> (known after apply)
      ~ id                  = "arn:aws:datasync:eu-central-1:account1id:location/loc-loc1id" -> (known after apply)
      - tags                = {} -> null
      ~ uri                 = "efs://eu-central-1.fs-fs1id/" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ ec2_config {
          ~ subnet_arn          = "arn:aws:ec2:eu-central-1:account1id:subnet/subnet-subnet1id" -> "arn:aws:ec2:eu-central-1:814050314857:subnet/subnet-subnet1id" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # aws_datasync_task.dags must be replaced
-/+ resource "aws_datasync_task" "dags" {
      ~ arn                      = "arn:aws:datasync:eu-central-1:account1id:task/task-task1id" -> (known after apply)
      ~ destination_location_arn = "arn:aws:datasync:eu-central-1:account1id:location/loc-loc1id" # forces replacement -> (known after apply) # forces replacement
      ~ id                       = "arn:aws:datasync:eu-central-1:account1id:task/task-task1id" -> (known after apply)
        name                     = "dags-s3-to-efs"
      - tags                     = {} -> null
        # (2 unchanged attributes hidden)

      - options {
          - atime                          = "BEST_EFFORT" -> null
          - bytes_per_second               = -1 -> null
          - gid                            = "INT_VALUE" -> null
          - log_level                      = "OFF" -> null
          - mtime                          = "PRESERVE" -> null
          - object_tags                    = "PRESERVE" -> null
          - overwrite_mode                 = "ALWAYS" -> null
          - posix_permissions              = "PRESERVE" -> null
          - preserve_deleted_files         = "PRESERVE" -> null
          - preserve_devices               = "NONE" -> null
          - security_descriptor_copy_flags = "NONE" -> null
          - task_queueing                  = "ENABLED" -> null
          - transfer_mode                  = "CHANGED" -> null
          - uid                            = "INT_VALUE" -> null
          - verify_mode                    = "POINT_IN_TIME_CONSISTENT" -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```